#### Data Formatting 
##### Data Formatting is the process of changing the apperance, structure or data type of data without changing its meaning, so it becomes consistent, readable and already for analysis.

In [98]:
import pandas as pd
df = pd.read_excel("Student_info.xlsx")

In [100]:
print(df)

    Unnamed: 0  S.No   Name   Roll  Marks
0            0     1     Raj    22     55
1            1     2     Dev    24     65
2            2     3      Om     1     55
3            3     4    Neil     6     65
4            4     5   Kunal     5     55
5            5     6     Sam     8     85
6            6     7   Aryan    20     70
7            7     8   Varun    15     60
8            8     9  Nikhil    14     65
9            9    10  Ramesh    13     85
10          10    11   Sunil     8     60

In [102]:
df["Marks"].head()
df["Marks"].max() # Here we are comfirming either it is in the percentage or not. So the output is greater than the 1 means it is not in percentage.

85

In [108]:
df["Marks"] = df["Marks"] / 5 # Here we are dividing the entire column by the 5.

In [106]:
df.head()

   Unnamed: 0  S.No  Name   Roll  Marks
0           0     1    Raj    22   11.0
1           1     2    Dev    24   13.0
2           2     3     Om     1   11.0
3           3     4   Neil     6   13.0
4           4     5  Kunal     5   11.0

In [116]:
df.rename(columns = {"Marks":"Obtained_Marks"}, inplace = True) # Here we have renamed the marks as the Obtained_Marks.

In [121]:
df.head()

   Unnamed: 0  S.No  Name   Roll  Obtained_Marks
0           0     1    Raj    22             2.2
1           1     2    Dev    24             2.6
2           2     3     Om     1             2.2
3           3     4   Neil     6             2.6
4           4     5  Kunal     5             2.2

In [118]:
df.dtypes

Unnamed: 0          int64
S.No                int64
Name               object
Roll                int64
Obtained_Marks    float64
dtype: object